{"description":"Securing an account does prevent it from getting hacked. What should you do to reduce the risk of getting hacked to the lowest?","id":1,"title":"Securing an online account","date":"2 Jan 2023","content":"# What is a secure online account ?\n\nA secure account does not make it unhackable, but it requires more effort and time. Well we often call it impossible, but there are still ways to make it happen, so don't assume. \n\n## What are the benefits ?\n\nOh, there are many \"benefits\" of having a secure account but there are some drawbacks too which we will talk about later on.\n- **Secure your identity** - When you create an account, you typically provide some personal information, such as your name, email address, and phone number. If your account is not secure, this information could be stolen by hackers. They could then use this information to commit identity theft, which can have a devastating impact on your financial and personal life.\n- **Protect your privacy** - Well, some people do not care about their privacy, but guess what, you are giving up your browsing history, search history, and even your location to the hackers. Which is very creepy if they let everyone know where you live.\n-  **Protect your reputation** - If your account is hacked, the hacker could post embarrassing or damaging information about you online. This could damage your reputation and make it difficult to get a job, rent an apartment, or even get a loan. Things that are done under your account is tantamount to things that are done by you.\n\nIn short, there are many good reasons to secure your account. By taking some action to secure your account, you'll have less hesitation  to worry about.\n\n## Getting Started\n\nBefore going any further, there are few fundamental procedures you must apply.\n\n#### 1. Don't reuse passwords\nUse a different password for each account. This will make it much harder for hackers to guess your passwords.\n\n#### 2. Be careful what information you share online\nDon't share your personal information with people you don't know.\n\n#### 3. Keep your software up to date\nSoftware updates often include security patches that can help to protect your account from hackers.\n\n#### 4. Use strong passwords\nA recommended strong password is at least 8 characters long and includes a mix of upper and lowercase letters, numbers, and symbols. But nothing is unhackable, we'll go deep into this later on.\n"}