{"description":"Talk about platforms & services that leveled up my workflow and enchanced my productivity.","id":3,"title":"Superb Platforms & Services","date":"5 Jan 2023","content":"## \"Amazing platforms/service providers\"\n\nThere are lots of amazing tools and services out there and I've handpicked a few that I use to share with you all. Most of them are either free, or has a free tier/trial, so don't hesitate to check them out.\n\nI'll specifying my use case for services listed below, turst me, they do a really good job on those tasks.\n\n### 1. Github\n\nTrust me, you should go create a Github account if you don't have one, there are too many handful features packed in Github. Let me list a few that I love using.\n\n- **Github Actions** - Continuous integration and continuous delivery (CI/CD) platform that allows you to automate build, test, and deployment pipeline\n- **Codespaces** - An online IDE. Development environment that's hosted in the cloud.\n- **Github Copilot** - Coding assistance \n- **Github Pages** - Host static sites on web for free without limitation \n\nThere is also the Github Student Pack for students who has a `.edu` school email. Trust me, its free and provide lots of offers, trials and perks. Claim it now if you're a student !\n\n### 2. Replit\n\nI use Replit mostly for hosting projects that can't be hosted on platforms like Vercel, for instance, a Discord Bot. I do own a VPS, but the specs aren't great and I would use Replit for low priority projects.\n\nReplit is an online development environment just like Github Codespaces, but with some differences. Personally, I do not like to interact with thier code editor, terminal, they're bad in my opinion. But the fact that I can spin up a development environment in a matter of seconds, and other than computing power, 10GB bandwith (shh... they didn't really enforce) & storage, there are no limits on time usage and so on. For this, I would give Replit a solid 8 out of 10. \n\nAlmost forgot about keeping your projects running for free. I've switched from Glitch to Replit due to Glitch blocking/preventing projects from staying awake. I was able to get around 80% of uptime on average with the help of UptimeRobot sending a HTTP request to my Replit project every 5 minute.\n\n### 3. Vercel\n\nVercel is yet another platform to host your applications, but its meant for hosting serverless applications. I'm using Vercel free tier to host this blog and many other projects as its stable and reliable. \n> Projects hosted on Vercel would never go down if something causes my code to crash\n\n### 4. Saucelabs\n\nSaucelabs is a cloud-hosted, web and mobile application automated/manual testing platform.\n\nWell you literally get an instant temporary device to play around with by just a few clicks, and its free! They provide real devices and virtual devices for free that you can choose to use for a few minutes to test out your website or do some sneaky stuff (please don't)...\n\nLet me name a few platforms/operating systems that you can choose from as a free user. There are iPhones, Android, Windows 10/11, MacOS 13,12 and many more.\n\n## Conclusion\n\nThere should be more platforms listed, but why aren't they listed here ?\n\nInflation, abuses and many other factors has caused many platforms to either stop providing their services for free, or they've added more limitation to the services they provide, thus making me switch or no longer use. That's the end of my list, I hope this list helps, have a good day!\n"}